{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "architectural-polish",
   "metadata": {},
   "source": [
    "Задача 1\n",
    "\n",
    "Перед каждым сезоном НБА проходит драфт, то есть церемония выбора игроков командами.\n",
    "Перед драфтом скаутские службы команд детально изучают потенциальных новичков. Одна из команд поручила вам написать программу для обработки собранных данных в соответствии с внутрикомандными стандартами.\n",
    "\n",
    "Каждый из новичков до этого провёл как минимум один сезон в студенческих лигах, так что для каждого игрока известны пять основных целочисленных параметров:\n",
    "\n",
    "●\tРост игрока – ожидаемый диапазон от 190 до 220 см.\n",
    "●\tРазмах рук (иначе говоря, wingspan) – ожидаемый диапазон от 200 до 250 см.\n",
    "●\tСреднее количество очков за матч – ожидаемый диапазон от 10 до 20.\n",
    "●\tСреднее количество подборов за матч – ожидаемый диапазон от 2 до 6.\n",
    "●\tСреднее количество передач за матч – ожидаемый диапазон от 3 до 7.\n",
    "\n",
    "Таким образом, каждый из параметров может оказаться ниже ожидаемого диапазона, в нижней половине ожидаемого диапазона, в верхней половине ожидаемого диапазона (середина входит в верхнюю половину) и выше ожидаемого диапазона.\n",
    "Перед драфтом требуется распределить игроков по следующим категориям:\n",
    "\n",
    "●\tуникальный игрок (таких ещё называют «единорогами» — unicorn) с сочетанием выдающихся физических данных и игровых навыков;\n",
    "●\tигрок, достойный выбора в первом раунде;\n",
    "●\tигрок, достойный выбора во втором раунде;\n",
    "●\tигрок, которого не стоит выбирать вообще.\n",
    "\n",
    "Если у игрока три параметра выше ожидаемого диапазона, причём среди них обязательно есть рост или размах рук, то игрок считается «единорогом» (категория 0)\n",
    "\n",
    "Игрока рекомендуется выбирать в первом раунде драфта (категория 1), если верно одно из следующих утверждений:\n",
    "\n",
    "●\tУ игрока два параметра выше ожидаемого диапазона и ещё один – как минимум в верхней половине ожидаемого диапазона.\n",
    "●\tУ игрока все параметры как минимум в ожидаемом диапазоне и не менее трёх – как минимум в верхней половине.\n",
    "\n",
    "Игрока рекомендуется выбирать во втором раунде драфта (категория 2), если верно одно из следующих утверждений:\n",
    "●\tУ игрока один параметр выше ожидаемого диапазона и ещё один — как минимум в верхней половине ожидаемого диапазона.\n",
    "●\tУ игрока три параметра как минимум в верхней половине ожидаемого диапазона.\n",
    "\n",
    "В остальных случаях тратить выбор драфта на этого игрока не рекомендуется (категория 3).\n",
    "Вам заданы параметры некоторых из 32 игроков текущего драфта (для объективности имена игроков не указаны). Ваша задача – для каждого игрока определить категорию, под которую он подпадает для вашей команды на драфте.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "twelve-injection",
   "metadata": {},
   "outputs": [],
   "source": [
    "def igrok(rost,razmah, ochki, podbor, peredach):\n",
    "    luchiy = 0; verx = 0; niz = 0; plox = 0\n",
    "    \n",
    "    if rost > 220: \n",
    "        luchiy = luchiy + 1\n",
    "    elif rost > 204 and rost <= 220: \n",
    "        verx = verx + 1\n",
    "    elif rost >= 190 and rost <= 204: \n",
    "        niz = niz + 1\n",
    "    else:\n",
    "         plox =  plox + 1\n",
    "        \n",
    "    if razmah > 250:\n",
    "        luchiy = luchiy + 1\n",
    "    elif razmah > 224 and razmah <= 250: \n",
    "        verx = verx + 1\n",
    "    elif razmah >= 200 and razmah <= 224: \n",
    "        niz = niz + 1\n",
    "    else:\n",
    "         plox =  plox + 1\n",
    "        \n",
    "    if ochki > 20:\n",
    "        luchiy = luchiy + 1\n",
    "    elif ochki > 14 and ochki <= 20: \n",
    "        verx = verx + 1\n",
    "    elif ochki >= 10 and ochki <= 14: \n",
    "        niz = niz + 1\n",
    "    else:\n",
    "        plox =  plox + 1\n",
    "    \n",
    "    if podbor > 6:\n",
    "        luchiy = luchiy + 1\n",
    "    elif podbor > 4 and podbor <= 6: \n",
    "        verx = verx + 1\n",
    "    elif podbor >= 2 and podbor <= 4: \n",
    "        niz = niz + 1\n",
    "    else: \n",
    "         plox =  plox + 1\n",
    "        \n",
    "    if peredach > 7:\n",
    "        luchiy = luchiy + 1\n",
    "    elif peredach > 4 and peredach <= 7:\n",
    "        verx = verx + 1\n",
    "    elif peredach >= 3 and peredach <= 4: \n",
    "        niz = niz + 1\n",
    "    else:\n",
    "        plox =  plox + 1\n",
    "    \n",
    "    if luchiy >= 3 and (rost > 220 or razmah > 250): \n",
    "        return 0\n",
    "    elif (luchiy >= 2 and verx >= 1) or (verx >= 3 and niz <= 2 and  plox == 0):\n",
    "        return 1\n",
    "    elif (luchiy >= 1 and verx >= 1) or (verx >= 3): \n",
    "        return 2\n",
    "    else: \n",
    "        return 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "joint-longer",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "2\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "print(igrok(230, 190, 16, 7, 9))\n",
    "print(igrok(205, 225, 15, 5, 2))\n",
    "print(igrok(210, 210, 30, 9, 9))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fewer-career",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
